{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задача 1\n",
    "\n",
    "Перед каждым сезоном НБА проходит драфт, то есть церемония выбора игроков командами.\n",
    "Перед драфтом скаутские службы команд детально изучают потенциальных новичков. Одна из команд поручила вам написать программу для обработки собранных данных в соответствии с внутрикомандными стандартами.\n",
    "\n",
    "Каждый из новичков до этого провёл как минимум один сезон в студенческих лигах, так что для каждого игрока известны пять основных целочисленных параметров:\n",
    "\n",
    "●\tРост игрока – ожидаемый диапазон от 190 до 220 см.\n",
    "●\tРазмах рук (иначе говоря, wingspan) – ожидаемый диапазон от 200 до 250 см.\n",
    "●\tСреднее количество очков за матч – ожидаемый диапазон от 10 до 20.\n",
    "●\tСреднее количество подборов за матч – ожидаемый диапазон от 2 до 6.\n",
    "●\tСреднее количество передач за матч – ожидаемый диапазон от 3 до 7.\n",
    "\n",
    "Таким образом, каждый из параметров может оказаться ниже ожидаемого диапазона, в нижней половине ожидаемого диапазона, в верхней половине ожидаемого диапазона (середина входит в верхнюю половину) и выше ожидаемого диапазона.\n",
    "Перед драфтом требуется распределить игроков по следующим категориям:\n",
    "\n",
    "●\tуникальный игрок (таких ещё называют «единорогами» — unicorn) с сочетанием выдающихся физических данных и игровых навыков;\n",
    "●\tигрок, достойный выбора в первом раунде;\n",
    "●\tигрок, достойный выбора во втором раунде;\n",
    "●\tигрок, которого не стоит выбирать вообще.\n",
    "\n",
    "Если у игрока три параметра выше ожидаемого диапазона, причём среди них обязательно есть рост или размах рук, то игрок считается «единорогом» (категория 0)\n",
    "\n",
    "Игрока рекомендуется выбирать в первом раунде драфта (категория 1), если верно одно из следующих утверждений:\n",
    "\n",
    "●\tУ игрока два параметра выше ожидаемого диапазона и ещё один – как минимум в верхней половине ожидаемого диапазона.\n",
    "●\tУ игрока все параметры как минимум в ожидаемом диапазоне и не менее трёх – как минимум в верхней половине.\n",
    "Игрока рекомендуется выбирать во втором раунде драфта (категория 2), если верно одно из следующих утверждений:\n",
    "●\tУ игрока один параметр выше ожидаемого диапазона и ещё один — как минимум в верхней половине ожидаемого диапазона.\n",
    "●\tУ игрока три параметра как минимум в верхней половине ожидаемого диапазона.\n",
    "В остальных случаях тратить выбор драфта на этого игрока не рекомендуется (категория 3).\n",
    "Вам заданы параметры некоторых из 32 игроков текущего драфта (для объективности имена игроков не указаны). Ваша задача – для каждого игрока определить категорию, под которую он подпадает для вашей команды на драфте.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "public class Player\n",
    "{\n",
    "    private int height = 0;\n",
    "    private int wingsan = 0;\n",
    "    private int battingAverage = 0;\n",
    "    private int selection = 0;\n",
    "    private int pass = 0;\n",
    "\n",
    "    public int rang = 3;\n",
    "    public Player(int h,int w, int b, int s, int p)\n",
    "    {\n",
    "        height = h;\n",
    "        wingsan = w;\n",
    "        battingAverage = b;\n",
    "        selection = s;\n",
    "        pass = p;\n",
    "\n",
    "        SetRang();\n",
    "    }\n",
    "\n",
    "    private void SetRang()\n",
    "    {\n",
    "        //rang 0:\n",
    "        int countHeight = 0;\n",
    "        int countMedium = 0;\n",
    "        int countLow = 0;\n",
    "\n",
    "        if (height > 220) {countHeight++;}else\n",
    "        if (height >= 205) { countMedium++;}\n",
    "        if (height >= 190) { countLow++;}\n",
    "\n",
    "        if (wingsan > 250) { countHeight++; }else\n",
    "        if (wingsan >= 225) { countMedium++; }\n",
    "        if (wingsan >= 200) { countLow++; }\n",
    "\n",
    "        if (battingAverage > 20) { countHeight++; }else\n",
    "        if (battingAverage >= 15) { countMedium++; }\n",
    "        if (battingAverage >= 10) { countLow++; }\n",
    "\n",
    "        if (selection > 6) { countHeight++; }else\n",
    "        if (selection >= 4) { countMedium++; }\n",
    "        if (selection >= 2) { countLow++; }\n",
    "\n",
    "        if (pass > 7) { countHeight++; }else\n",
    "        if (pass >= 5) { countMedium++; }\n",
    "        if (pass >= 3) { countLow++; }\n",
    "\n",
    "        if (countHeight >= 3 && (height>220 || wingsan >250)) { rang = 0; return;}\n",
    "        if((countHeight >= 2 && countMedium > 0)|| (countMedium >= 3 && countLow==5)) { rang = 1; return;}\n",
    "        if((countMedium>=1 && countHeight >= 1) || (countMedium >= 3)) { rang = 2; return;}\n",
    "\n",
    "        rang = 3;\n",
    "\n",
    "\n",
    "    }\n",
    "\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Player № 0 rang: 1\n"
     ]
    }
   ],
   "source": [
    "\n",
    "public void Calculation()\n",
    "{\n",
    "    \n",
    "Player[] players = new Player[1];\n",
    "\n",
    "    int h,w,s,r,p;\n",
    "    \n",
    "    //Входные данные\n",
    "    h = 200; //Рост игрока – ожидаемый диапазон от 190 до 220 см.\n",
    "    w = 230; //Размах рук (иначе говоря, wingspan) – ожидаемый диапазон от 200 до 250 см.\n",
    "    s = 15; //Среднее количество очков за матч – ожидаемый диапазон от 10 до 20.\n",
    "    r = 6; //Среднее количество подборов за матч – ожидаемый диапазон от 2 до 6.\n",
    "    p = 8; //Среднее количество передач за матч – ожидаемый диапазон от 3 до 7.\n",
    "\n",
    "    players[0] = new Player(h,w,s,r,p);\n",
    "\n",
    "\n",
    "for (int i = 0; i < players.Length; i++)\n",
    "{\n",
    "    Console.WriteLine(\"Player № \" + i + \" rang: \" + players[i].rang);\n",
    "}\n",
    "}\n",
    "\n",
    "Calculation();"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".NET (C#)",
   "language": "C#",
   "name": ".net-csharp"
  },
  "language_info": {
   "file_extension": ".cs",
   "mimetype": "text/x-csharp",
   "name": "C#",
   "pygments_lexer": "csharp",
   "version": "8.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
